In [8]:
import pandas as pd
import numpy as np
import os

In [9]:
path  = r'C:\Users\esgib\Desktop\Alina\Course 4\Instacart Basket Analysis'

In [10]:
df_cust = pd.read_csv(os.path.join(path, '02 Data', 'Original data', 'customers.csv'))

In [11]:
df_cust.shape

(206209, 10)

In [12]:
df_cust.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [15]:
#droping columns 'First Name', 'Surnam', 'date_joined' as we won't need them in our research and as they could lead to issues related to data savity
df_cust = df_cust.drop(['First Name', 'Surnam', 'date_joined'], axis = 1)

In [16]:
df_cust.head()

   user_id  Gender       STATE  Age  n_dependants fam_status  income
0    26711  Female    Missouri   48             3    married  165665
1    33890  Female  New Mexico   36             0     single   59285
2    65803    Male       Idaho   35             2    married   99568
3   125935  Female        Iowa   40             0     single   42049
4   130797  Female    Maryland   26             1    married   40374

In [18]:
df_cust.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [19]:
df_cust.dtypes

user_id          int64
Gender          object
STATE           object
Age              int64
n_dependants     int64
fam_status      object
income           int64
dtype: object

In [23]:
#changing datatypes to avoid issues with memoryError
df_cust['user_id'] = df_cust['user_id'].astype('int32')
df_cust['Age'] = df_cust['Age'].astype('int8')
df_cust['n_dependants'] = df_cust['n_dependants'].astype('int8')
df_cust['income'] = df_cust['income'].astype('int32')

In [24]:
df_cust.dtypes

user_id          int32
Gender          object
STATE           object
Age               int8
n_dependants      int8
fam_status      object
income           int32
dtype: object

In [25]:
#renaming columns
df_cust = df_cust.rename(columns={'Gender': 'gender', 'STATE': 'state', 'Age': 'age', 'n_dependants': 'nr_dependants'})

In [26]:
df_cust.columns

Index(['user_id', 'gender', 'state', 'age', 'nr_dependants', 'fam_status',
       'income'],
      dtype='object')

In [28]:
#checking for missing and null values in user_id column
print(df_cust['user_id'].isnull().sum())
print(df_cust['user_id'].isna().sum())

0
0

In [29]:
#checking for missing and null values in gender column
print(df_cust['gender'].isnull().sum())
print(df_cust['gender'].isna().sum())

0
0

In [30]:
#checking for missing and null values in state column
print(df_cust['state'].isnull().sum())
print(df_cust['state'].isna().sum())

0
0

In [31]:
#checking for missing and null values in age column
print(df_cust['age'].isnull().sum())
print(df_cust['age'].isna().sum())

0
0

In [32]:
#checking for missing and null values in nr_dependants column
print(df_cust['nr_dependants'].isnull().sum())
print(df_cust['nr_dependants'].isna().sum())

0
0

In [33]:
#checking for missing and null values in fam_status column
print(df_cust['fam_status'].isnull().sum())
print(df_cust['fam_status'].isna().sum())

0
0

In [34]:
#checking for missing and null values in income column
print(df_cust['income'].isnull().sum())
print(df_cust['income'].isna().sum())

0
0

Comment: no missing values found

In [35]:
#better later than never :) checkign for mixed data types in columns
for col in df_cust.columns.tolist(): 
    weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1) 
    if len (df_cust[weird]) > 0: print (col)

In [37]:
#checking for duplicates
df_cust_dup = df_cust[df_cust.duplicated()]
df_cust_dup

Empty DataFrame
Columns: [user_id, gender, state, age, nr_dependants, fam_status, income]
Index: []

Comment: no duplicates found

In [38]:
df_cust.shape

(206209, 7)

In [39]:
#importing orders&products information
df_op = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared data', 'Orders_products_merged.pkl'))

In [40]:
df_op.head()

,order_id,product_id,add_to_cart_order,reordered,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order,product_name,department_id,prices
0,2,33120,1,1,202279,3,5,9,8.0,Organic Egg Whites,16.0,11.3
1,2,28985,2,1,202279,3,5,9,8.0,Michigan Organic Kale,4.0,13.4
2,2,9327,3,0,202279,3,5,9,8.0,Garlic Powder,13.0,3.6
3,2,45918,4,1,202279,3,5,9,8.0,Coconut Butter,13.0,8.4
4,2,30035,5,0,202279,3,5,9,8.0,Natural Sweetener,13.0,13.7

In [42]:
df_op.shape

(32433030, 12)

In [43]:
#merging products & order information with customer information
ord_prod_all = df_op.merge(df_cust, on = 'user_id', how = 'left', indicator = True)

In [44]:
ord_prod_all.head()

,order_id,product_id,add_to_cart_order,reordered,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order,product_name,department_id,prices,gender,state,age,nr_dependants,fam_status,income,_merge
0,2,33120,1,1,202279,3,5,9,8.0,Organic Egg Whites,16.0,11.3,Male,Idaho,57,3,married,98119,both
1,2,28985,2,1,202279,3,5,9,8.0,Michigan Organic Kale,4.0,13.4,Male,Idaho,57,3,married,98119,both
2,2,9327,3,0,202279,3,5,9,8.0,Garlic Powder,13.0,3.6,Male,Idaho,57,3,married,98119,both
3,2,45918,4,1,202279,3,5,9,8.0,Coconut Butter,13.0,8.4,Male,Idaho,57,3,married,98119,both
4,2,30035,5,0,202279,3,5,9,8.0,Natural Sweetener,13.0,13.7,Male,Idaho,57,3,married,98119,both

In [46]:
#checking the merge
ord_prod_all['_merge'].value_counts()

both          32433030
left_only            0
right_only           0
Name: _merge, dtype: int64

In [47]:
#dropping merge column as we won't need it in the future
ord_prod_all = ord_prod_all.drop(columns = '_merge')

In [48]:
ord_prod_all.head()

,order_id,product_id,add_to_cart_order,reordered,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order,product_name,department_id,prices,gender,state,age,nr_dependants,fam_status,income
0,2,33120,1,1,202279,3,5,9,8.0,Organic Egg Whites,16.0,11.3,Male,Idaho,57,3,married,98119
1,2,28985,2,1,202279,3,5,9,8.0,Michigan Organic Kale,4.0,13.4,Male,Idaho,57,3,married,98119
2,2,9327,3,0,202279,3,5,9,8.0,Garlic Powder,13.0,3.6,Male,Idaho,57,3,married,98119
3,2,45918,4,1,202279,3,5,9,8.0,Coconut Butter,13.0,8.4,Male,Idaho,57,3,married,98119
4,2,30035,5,0,202279,3,5,9,8.0,Natural Sweetener,13.0,13.7,Male,Idaho,57,3,married,98119

In [50]:
ord_prod_all.shape

(32433030, 18)

In [51]:
#savign the results in Prepared Data folder
ord_prod_all.to_pickle(os.path.join(path, '02 Data', 'Prepared data', 'Orders_products_all.pkl'))